import requests


# 发送post请求，表单类型的参数，使用data传参
# 登录接口
def test(mobilephone, code, pwd='123456', regname=''):
    url = 'http://jy001:8081/futureloan/mvc/api/member/register'
    cs = {"mobilephone": mobilephone, "pwd": pwd, "regname": regname}
    r = requests.post(url, data=cs)
    print(r.text)
    assert r.json()['code'] == code


# 输入合法手机号和6位密码，未输入注册名，注册成功
test("13645834674", "10001")

# 输入合法手机号和注册名，密码输入18位，注册成功
test("13645834924", "10001", "123456789012345678", "小北")

# 昵称过长 ConnectionError
test("13645834904", "10001", "12345678", "小北小那就好多少级女个我女会计计的内立会计的撒牛刀次无按此陈丽娜内立法来看你了安徽阿克江小北小")
# 未输手机号，注册失败，返回值手机号不能为空
# test("", '20103')

# 未输密码，注册失败，返回值密码不能为空
test('13645834624', "20103", "")

# 手机号和密码均为空，返回值是手机号不能为空
test("", "20103", "")

# 输入5位密码，注册失败，返回值密码长度必须为6~18
test("13645834644", "20108", "12345")

# 输入19位密码，注册失败，返回值密码长度必须为6~18
test('13645834644', "20108", "1234567890123456789")

# 输入过短手机号，注册失败，返回值手机号码格式不正确
test("1364583464", "20109")

# 输入过长手机号，注册失败，返回值手机号码格式不正确
test("136458346444", "20109")

# 格式不正确的手机号，注册失败，返回值手机号码格式不正确
test("11111111111", "20109")

# 输入已注册的手机号，注册失败，返回值手机号码已被注册
test("13645834674", "20110")
